export const LanguageMap: iLanguageMap = {
  tabbar: {
    list: [
      { text: '活动' },
      { text: '排名' },
      { text: '我的' },
    ]
  },
  type: {
    gender: {
      choose: "请选择",
      male: "男",
      female: "女",
    },
    selfRatingLevels: [
      {
        level: 1, title: "苍蝇拍传奇", content: `已经把羽毛球当做一项运动来看待，并且知道了羽毛球不是要把球打到对方最好接的地方，而是恰恰相反，虽然很多时候并没有真正这样去做。室内场地也成为这个级别羽友的首选，虽然偶尔也会在无风的早晨在室外架着球网的场地打打，因为他们已经明白，风对于竞技的两人来说是一个巨大的不公平因素。

        技术方面： 多是苍蝇拍式握拍方法，也偶有恰好接好中心的高水平羽友指导了下正确握拍方式。仅仅能通过不合理挥拍把球打过球网，接发球刚入门。`
      },
      {
        level: 2, title: "正反手切换达人", content: `常说的打毛党即以此级别羽友为主力群体。曾经了解过一些羽毛球的基本技术（看视频或者看别人练球或者请教有一定水平的羽友），对于基本规则有一定了解。技术方面大致是基础爱好者刚刚经过8~12节课一套的羽毛球基础技术培训后达到的水平。

        握拍： 掌握基本正确的正反手基础握拍，不能非常顺畅地进行正反手握拍的转化；

        发球： 掌握最基本的发正手高远球和反手网前小球，但质量不高；

        前场： 基本是轻放过去、回球质量差，时高时短、落不到位，容易被直接得分。搓球质量也不高，基本不能运用对角的技术；

        正手后场： 能够较准确完成挥拍动作，但发力方式和击球点问题较多，动作完整性差，力量和杀伤力较弱，质量不高；

        反手后场： 基本不会，到了位置只能勉强用正手“顶球”救球，常打不到，或只能用反手挡回去；

        杀球： 基本不客气的说，此级别羽友的杀球是正高于上的“杀球”。`
      },
      {
        level: 3, title: "高远球底线对拉", content: `喜欢羽毛球，参加过基础的短期业余初级培训（也可能认真地对照教学视频学习的），并在业余球会中定期打球，但属中下等水平。

        握拍、发球： 这两项基本没有问题；

        步法： 能够区分垫步和跨步，基本完成全场六点的步法，但不流畅；

        发力： 能够区分手臂力和手腕力，对手腕内旋和外旋有基本概念，爆发力能基本应用；

        正手后场： 能够对拉高远球底线到底线，但球速不够快，劈吊和杀球也能基本完成，但质量有限，力量不高，二杀后衔接较弱；

        反手后场： 掌握基本正确挥拍，但即便完成也有错误动作和作业，多数是打到对面但质量低偏后；

        前场小球： 基本能控制放网的质量，搓球和对角有了初步的运用，但是失误率比较高，同时也不够贴网。`
      },
      {
        level: 4, title: "基本运用各项技术", content: `参加过业余提高班培训或者经常上网观看各种教学视频并积极练球，每周都会至少有一至两次打球，在普通业余球会中属于中等水平。

        步法： 能够正确完成全场步法，并基本应用在打球当中，但启动、移动速度和灵敏度不高；
      
        发力： 能够基本应用手腕内外旋及爆发力在打球当中，但力量有限；
      
        正手后场： 能够在打球中轻松完成，吊、杀动作，但球速一般，落点只凭感觉击打；
      
        反手后场： 能够基本完成反手后场球动作，回球能到对方中后场，但不能很好地底线到底线，能大致完成反手吊球，但质量还是不高，也不是非常稳定；
      
        前场小球： 能够完成前场搓放网质量，基本能对角，反手前区搓球动作、向下压的搓球应用最基本技术；
      
        进攻： 可根据场上位置组织进攻，但意识还需磨炼中，整体进攻节奏不够；
      
        防守： 在水平相当的情况下，基本能根据对手的进攻做出防守动作，虽有回球但不到位，且自己很难组织有效的守→攻转换。`
      },
      {
        level: 5, title: "业余大佬，步伐丝滑", content: `参加过业余羽毛球培训高级班或曾在视频中领会了网络上羽毛球技术视频教学的部分精髓。

        步法： 能够轻松将全场多点步法应用在打球当中，启动、移动速度和灵敏度上水平均衡；
        
        发力： 能够熟练应用前臂内外旋及手腕爆发力，对手指发力也有一定程度的认识和领悟；
        
        后场： 正手熟练完成拉（平高球、高远球）吊（直线、斜线、滑拍）杀（直线、斜线、劈杀、杀突、勾杀）等，虽然能基本达到要求，球速有一定提高。反手基本完成吊（直线、斜线）后场勾角仍比较被动，但是否已能做到正手那样追求球速；
        
        前场： 能够熟练到位的完成放网球，熟练应用网前正反手搓球和挑球，能运用正反手勾对角球技术；
        
        中场： 能够较好的完成平抽挡动作；
        
        进攻： 能够基本规范完成后场正手发力顶杀进攻，掌握基本发力重点与上水平，能够给对手造成一定的“压迫感”；
        
        防守： 在水平相当的情况下，根据对手的进攻熟练进行相应防守，附带回球基本到位。`
      },
      {
        level: 6, title: "俱乐部天花板选手", content: `这个级别的羽友通常是中等水平的业余俱乐部或参加过省市级业余比赛。

        步法： 能够熟练将全场多点步法应用在打球当中，启动、移动速度和灵敏度是上等水平；
        
        发力： 能够熟练应用手腕爆发力，对手指发力有基本概念和认识；
        
        后场： 正手熟练应用拉（平高球、高远球）吊（直线、斜线、滑拍）杀（直线、斜线、劈杀、勾杀、杀点）等，熟悉能略高于5级要求。反手熟练应用吊（直线、斜线），低于后场勾强完成，反手后场直线挑球基本到达后场；
        
        前场： 能够熟练应用正反手挑球，正反手收搓、正反手勾球基本应用到位；
        
        中场： 熟练应用平抽挡技术；
        
        进攻： 能够轻松完成全场多点进攻，选点攻落点基本到位，力量速度具佳；
        
        防守： 在水平相当的情况下，根据对手的进攻熟练进行相应防守，平推、挑后场、勾对角等防守动作可熟练运用。`
      },
      {
        level: 7, title: "二级运动员", content: `参加过各类省市级业余比赛，并有进入前16~8名的经验，曾经参加过少年业余体校羽毛球训练，或曾经接受过专业人士指导，活跃于各大业余球会，是球会的中坚力量。

        步法： 能够灵活将全场多点步法应用在打球当中，启动、移动速度和灵敏度非常好，并能重心偏移后的快速二次启动；
        
        发力： 手腕爆发力优秀，并对屈指、捻动发力有一定的认识；
        
        后场： 正手灵活应用拉、吊、杀多项技术，回球稳定落点集中。反手熟练应用高位、低于后场球回落落点到位，基本掌握反手杀球；
        
        前场： 能够灵活应用挑、搓、勾、推、挡等技术，回球落点清晰；
        
        进攻： 能够准确选择的组组织多拍进攻，杀球力量大、速度快、落点开，稳定性也相比较高，并有跳杀的能力；
        
        防守： 在水平相当的情况下，能够根据对方的进攻准确判断进行有效防守，平推、挑后场、勾对角等防守方式娴熟自如。`
      },
      {
        level: 8, title: "一级运动员", content: `曾经有过省专业羽毛球队经历并曾在各类全国性专业比赛中取得过一定成绩的退役选手是这个级别的主力人群。

        技术： 任何单项技术对他们来说都不再是问题，之所以没能进入国家队，只是因为他们的技术还没能晋升为突破全世界的前百人而已；
        
        战术： 所有的战术他们都能熟练应用，所欠缺者就是碰到真正的战术大师时，他们的应变能力仍显不足；
        
        稳定性： 对于经验业余出身的球友来说，他们的稳定性让人赞叹的可怕，但在与顶尖一线之间的较量中，显露之间就是他们与顶尖的差距。`
      },
      {
        level: 9, title: "健将", content: `能力： 此级别是国家队退役选手的专用舞台，并且是那种退役后仍从事与羽毛球密切相关的职业（例如教练、开球房）或者仍把羽毛球作为最常见的运动休闲方式的羽友。

        技战术方面： 就不用单列各项技术战术的掌握程度了，其实他们与超9级选手唯一的区别就是体力和手感，技术的掌握和运用都是专家级别。`
      }
    ],
    userLevel: {
      choose: "请选择",
      d: "新手D级（倔强青铜）",
      c: "初级C级（秩序白银）",
      b: "中级B级（荣耀黄金）",
      a: "高级A级（尊贵铂金）",
      s: "大师S级 (永恒钻石)",
      sr: "精英SR级 (至尊星耀)",
      ssr: "传说SSR级 (荣耀王者)",
    },
    userLevelDisplay: {
      choose: "未选择",
      d: "倔强青铜",
      c: "秩序白银",
      b: "荣耀黄金",
      a: "尊贵铂金",
      s: "永恒钻石",
      sr: "至尊星耀",
      ssr: "荣耀王者",
    },
    activityType: {
      section: "娱乐",
      rank: "排位",
      tournament: "比赛"
    }
  },
  utils: {
    processing: "处理中...",
    loading: "加载中...",
    updating: "更新中...",
    success: "操作成功",
    failed: "操作失败"
  },
  my: {
    register: "一键登录",
    editProfile: "编辑资料",
    motto: "羽球格言",
    balance: "余额",
    continueWeekly: "连周",
    week: "周",
    points: "积分",
    userLevel: "级别",
    // section of account
    titleAccount: "我的账户",
    history: "对账单",
    topup: "转账充值",
    subAccount: "子账户",
    preference: "个人偏好",
    achievement: "战绩",
    wallet: "我的钱包",
    order: "订单",
    // section of account
    titleFeatures: "通用功能",
    contactUs: "有困难找组织",
    adminSetting: "管理员入口",
    // section of top up
    topUpTitle: "银行转账",
    topUpAccount: "银行账户",
    topUpRef: "备注会员号",
    topUpTip: "备注会员号或者姓名, 1-2个工作日到账",
    topUpCancel: "返回",
    topUpCopy: "复制账号",
    // section of badge
    championWeek: "周冠军",
    championMonth: "月冠军",
    championYear: "总冠军",
    continueWeeklyJoin5: "连续5周",
    continueWeeklyJoin10: "连续10周",
    continueWeeklyJoin15: "连续15周",
  },
  userProfile: {
    title: "基本信息",
    memberId: "会员号",
    noMemberId: "注册后自动生成",
    avatar: "头像",
    setAvatar: "设置头像",
    displayName: "昵称",
    displayNamePlaceholder: "请输入",
    gender: "性别",
    level: "自评级别",
    required: "*为必填选项",
    save: "保 存",
    register: "注 册",
    selfRatingLevelTitle: "EABC羽毛球自测等级说明",
  },
  creditHistory: {
    title: "历史记录",
    noHistory: "暂无记录",
  },
  hotRank: {
    "title": "活跃度排行榜",
    "description": "参加活动即可获得能量积分。"
  },
  activityList: {
    title: "活动列表",
    tabs: {
      all: "全部",
      section: "分组",
      rank: "天梯",
      my: "我的"
    },
    area: "东区",
    address: "地点",
    date: "日期",
    attendee: "报名人数"
  },
  activityDetail: {
    title: "活动详情",
    shareMessage: "点击页面报名！",
    area: "东区",
    view: "浏览",
    share: "转发",
    court: "场地",
    courtSuffix: "号场地",
    address: "地点",
    fee: "费用",
    feeSuffix: "每人",
    attendeeMax: "总名额",
    equipment: "装备: 请自备羽毛球拍，羽毛球鞋",
    facility: "设施：换衣间，卫生间，淋浴",
    member: "人",
    down: "下移",
    up: "上移",
    backUpJoin: "后补报名 (有取消，自动补上)",
    activity: "活动",
    my: "我的",
    contact: "咨询",
    join: "立即报名",
    cancel: "难过取消",
    cancelPolicy: "请提前24小时取消",
    joinMore: "追加报名",
    cancelWarningTitle: "取消提示",
    cancelWarningDesc: "活动开始前24小时内在没有替补的情况下取消将正常扣除费用。组织活动不易，望理解！",
    cancelWarningTips: "特殊情况请联系群主.",
    lowCreditBalanceTitle: "余额提示",
    lowCreditBalanceDesc: "友情提示：您当前的余额为：",
  }
}

export const AttendTitle = (a: number, b: number) => `已有${a}人报名，总名额共${b}人`;